Revit 2026 API

# FillGridOffset Property

---

Gets and sets the offset of the fill grid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Offset { get; set; }
```
```vb
Public Property Offset As Double
	Get
	Set
```
```cpp
public:
property double Offset {
	double get ();
	void set (double value);
}
```
```fsharp
member Offset : float with get, set
```

#### Property Value

Double The offset of the fill grid.

Offset defines the distance between parallel lines. A zero offset is not allowed.

#### Reference

FillGrid Class

Autodesk.Revit.DB Namespace